Revit 2027 API
Entity.RecognizedField Method
 Checks whether a Field belongs to the same Schema as this Entity.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RecognizedField(
	Field field
)
Public Function RecognizedField (
	field As Field
) As Boolean
public:
bool RecognizedField(
	Field^ field
)
member RecognizedField :
        field : Field -> bool
Parameters
field Field
 The Field to check.
Return Value
Boolean
 True if the Field belongs to the same Schema as this Entity.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace